{
    "Task": "Hip Kellgren-Lawrence scoring",
    "Type": "Classification",
    "Description": "This task involves classifying the Kellgren-Lawrence grade of osteoarthritis for both the left and right sides as described in the radiology report. The grades range from 0 to 4, with additional categories for 'not applicable (n)' and 'prosthesis (p)'. The output should provide a classification for each side.\n\nKellgren-Lawrence scale:\n\n• 0: no radiographic core features of osteoarthritis, no joint gap narrowing, no bone abnormalities. Keywords: no coxarthrosis\n\n• 1: possible joint gap narrowing, possible osteophyte formation. Keywords: no obvious coxarthrosis\n\n• 2: obvious osteophyte formation, possible joint gap narrowing. Keywords: minimal coxarthrosis, incipient coxarthrosis, mild coxarthrosis, minor coxarthrosis\n\n• 3: moderate osteophyte formation, marked joint gap narrowing and some sclerosis, possible degenerative bone defects. Keywords: moderate coxarthrosis\n\n• 4: large definite osteophytes, definite joint gap narrowing and severe sclerosis, definite degenerative bone defects. Keywords: end-stage coxarthrosis, severe coxarthrosis, substantial coxarthrosis, strong coxarthrosis, obvious degeneration, obvious osteophyte formation\n\n• not applicable: there is not enough information in the report to give an assessment\n\n• prosthesis: the patient has a hip prosthesis.",
    "Data_Path": "test.json",
    "Input_Field": "text",
    "Label_Field": "multi_label_multi_class_classification_target",
    "Parser_Format": {
        "left": {
            "type": "str",
            "description": "The Kellgren-Lawrence grade of osteoarthritis for the left hip. An integer from 0 to 4, or one of 'n' for not applicable or 'p' for prosthesis.",
            "literals": [
                "0",
                "1",
                "2",
                "3",
                "4",
                "n",
                "p"
            ]
        },
        "right": {
            "type": "str",
            "description": "The Kellgren-Lawrence grade of osteoarthritis for the right hip. An integer from 0 to 4, or one of 'n' for not applicable or 'p' for prosthesis.",
            "literals": [
                "0",
                "1",
                "2",
                "3",
                "4",
                "n",
                "p"
            ]
        }
    }
}