{
    "Task": "Anonymization",
    "Type": "Single Label Named Entity Recognition",
    "Description": "Identify and classify sequences of tokens in the given text that qualify as Personally Identifiable Information (PII). Replace each identified sequence with the corresponding predefined category tag. Use only the categories provided below—no additional or undefined types should be introduced. Predefined PII Categories: 1. Dates (<DATUM>): Includes specific calendar dates, such as 'March 5, 2023', '05/03/2023', or '2023-03-05'. 2. Person Names (<PERSOON>): Full names or identifiable portions of names (e.g., 'John Doe', 'Dr. Smith', or 'Mr. Johnson'). 3. Report Identifiers (<RAPPORT_ID>): Alphanumeric or symbolic identifiers assigned to reports (e.g., 'RPT-12345' or 'Report #6789'). 4. Places (<PLAATS>): Names of locations such as cities, countries, addresses, or landmarks (e.g., 'New York', '123 Elm Street', or 'Mount Everest'). 5. Personally Identifying Numbers (<PHINUMMER>): Numbers uniquely tied to an individual, including Social Security Numbers (SSNs), Tax Identification Numbers (TINs), passport numbers, or other similar identifiers (e.g., '123-45-6789', 'A1234567'). 6. Clinical Trial Names (<STUDIE_NAAM>): Official names of clinical trials or studies (e.g., 'Study XYZ-123', 'Phase III Trial of ABC'). 7. Hospital Accreditation Numbers (<ACCREDITATIE_NUMMER>): Unique codes or numbers issued to hospitals or healthcare institutions as part of accreditation (e.g., 'HOSP-98765'). 8. Times (<TIJD>): Specific times of day, including those with time zones (e.g., '3:45 PM', '15:45 UTC'). 9. Patient Ages (<LEEFTIJD>): Exact ages or references to ages that directly identify an individual (e.g., '42 years old', 'Age: 7'). Instructions: 1. Identification: Identify sequences of text that represent PII. Ensure accurate recognition based on context. 2. Classification: Replace each identified sequence with the appropriate category tag listed above (e.g., a date like 'March 5, 2023' should be replaced with <DATUM>). 3. Output Format: Return the text with the PII replaced by the respective tags. 4. Accuracy: Ensure that each entity is classified into the correct category. Avoid false positives or incorrect tagging. 5. No PII Detected: If no PII entities are present, return the original text unaltered. 6. Be Cautious: Avoid accidentally anonymizing numerical measurements, such as '5 mg', '180 cm', or '25 ml', as these are not PII. Additional Notes: Use the tags exactly as specified, maintaining case sensitivity. Focus on providing structured, accurate output. Do not infer or assume entities beyond what is explicitly stated in the text. By adhering to these instructions, deliver a precise and structured identification of PII entities within the provided text.",
    "Data_Path": "test.json",
    "Input_Field": "text",
    "Label_Field": "text_target",
    "Parser_Format": {
        "text": {
            "type": "str",
            "description": "The text with the identified PII entities replaced by their respective tags."
        }
    }
}